//locate2d.h

#pragma once
#include <opencv2/core/core.hpp>  
#include <opencv2/highgui/highgui.hpp>  
#include <opencv2/imgproc/imgproc.hpp>  
#include <opencv2/xfeatures2d.hpp>
#include <stdio.h>

using namespace std;
using namespace cv;

//全局变量声明-----------------------------------
Mat src, temp, gray, binary, border, abs_border;
int thresh = 30;//角点检测阈值  
int max_thresh = 175;//角点检测最大阈值  
int thresh_bi = 128;//二值图阈值
int max_thresh_bi = 255;//二值图最大阈值
int offset = 15;//形态学运算偏移量
int key = 0;;//按键键值
int x_1, y_1, count_1, theta_1;//图像1的零件位置、方向
int x_2, y_2, count_2, theta_2;//图像2的零件位置、方向
//-----------------------------------------------

//图像载入函数-----------------------------------
int loadimg();
//-----------------------------------------------

//回调函数---------------------------------------
void on_detect(int, void *);
//-----------------------------------------------

//图像预处理函数---------------------------------
void preproc();
//-----------------------------------------------

//轮询获取键值函数-------------------------------
int getkey();
//-----------------------------------------------

//零件定位函数-----------------------------------
void locate2d();
//-----------------------------------------------

//重新载入图像函数-------------------------------
void restart();
//-----------------------------------------------

//提示文本显示函数-------------------------------
void helptext();
//-----------------------------------------------